requests/bis/fixed_ip_bis.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:types="http://www.deltasolutions.ru/om/rt/LyraOmsService/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <SOAP-ENV:Body>
      <types:SubmitOrderRequest>
         <Components>
            <Component>
               <Attributes>
                  <Attribute>
                     <Name>action_code</Name>
                     <Value>54</Value>
                  </Attribute>
                  <Attribute>
                     <Name>address</Name>
                     <Value>г. Курган; ул. КАРБЫШЕВА</Value>
                  </Attribute>
                  <Attribute>
                     <Name>atbr_id</Name>
                     <Value>3</Value>
                  </Attribute>
                  <Attribute>
                     <Name>bis_additional_attr</Name>
                     <Value><![CDATA[<GUP_ATTRS><Framed-IP-Address/></GUP_ATTRS>]]></Value>
                  </Attribute>
                  <Attribute>
                     <Name>cfs_spec_id</Name>
                     <Value>fixed_ip</Value>
                  </Attribute>
                  <Attribute>
                     <Name>city</Name>
                     <Value>13763</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_birth_date</Name>
                     <Value>1961-01-01T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_birth_place</Name>
                     <Value>г. Курган</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_id</Name>
                     <Value>31459207</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_name</Name>
                     <Value>НОВЫЙ АБОНЕНТ КУРГАНА</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_pass_date</Name>
                     <Value>2015-01-01T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_pass_num</Name>
                     <Value>123654</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_pass_place</Name>
                     <Value>г. Курган</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_pass_ser</Name>
                     <Value>5701</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_phone</Name>
                     <Value>9519364099</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_type</Name>
                     <Value>3</Value>
                  </Attribute>
                  <Attribute>
                     <Name>connection_scheme</Name>
                     <Value>93</Value>
                  </Attribute>
                  <Attribute>
                     <Name>contract_id</Name>
                     <Value>6558769</Value>
                  </Attribute>
                  <Attribute>
                     <Name>delivery_date</Name>
                     <Value>2015-08-27T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>department_id</Name>
                     <Value>209</Value>
                  </Attribute>
                  <Attribute>
                     <Name>exec_date</Name>
                     <Value>2015-08-26T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>flat</Name>
                     <Value>15</Value>
                  </Attribute>
                  <Attribute>
                     <Name>house</Name>
                     <Value>60</Value>
                  </Attribute>
                  <Attribute>
                     <Name>installation_date</Name>
                     <Value>2015-08-27T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>instance_id</Name>
                     <Value>73775840</Value>
                  </Attribute>
                  <Attribute>
                     <Name>local_idn_set</Name>
                     <Value>4</Value>
                  </Attribute>
                  <Attribute>
                     <Name>lyra_service_code</Name>
                     <Value>30071</Value>
                  </Attribute>
                  <Attribute>
                     <Name>main_connection_scheme</Name>
                     <Value>171</Value>
                  </Attribute>
                  <Attribute>
                     <Name>need_installation</Name>
                     <Value>0</Value>
                  </Attribute>
                  <Attribute>
                     <Name>nri_rnabn</Name>
                     <Value>13957097</Value>
                  </Attribute>
                  <Attribute>
                     <Name>order_action_type</Name>
                     <Value>CE</Value>
                  </Attribute>
                  <Attribute>
                     <Name>order_start_date</Name>
                     <Value>2015-08-26T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>pack_id</Name>
                     <Value>24546</Value>
                  </Attribute>
                  <Attribute>
                     <Name>parent_virtual_number</Name>
                     <Value>77456000202</Value>
                  </Attribute>
                  <Attribute>
                     <Name>prcl_amount</Name>
                     <Value>0</Value>
                  </Attribute>
                  <Attribute>
                     <Name>prcl_id</Name>
                     <Value>173755</Value>
                  </Attribute>
                  <Attribute>
                     <Name>prcl_quant</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>rtpl_id</Name>
                     <Value>30272</Value>
                  </Attribute>
                  <Attribute>
                     <Name>run_billing</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>service_receiver</Name>
                     <Value>2</Value>
                  </Attribute>
                  <Attribute>
                     <Name>srls_id</Name>
                     <Value>100001</Value>
                  </Attribute>
                  <Attribute>
                     <Name>srls_quant</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>street</Name>
                     <Value>302430</Value>
                  </Attribute>
                  <Attribute>
                     <Name>subscriber_id</Name>
                     <Value>37308323</Value>
                  </Attribute>
                  <Attribute>
                     <Name>technology</Name>
                     <Value>FTTx</Value>
                  </Attribute>
                  <Attribute>
                     <Name>tx_id</Name>
                     <Value>336431438</Value>
                  </Attribute>
                  <Attribute>
                     <Name>virtual_number</Name>
                     <Value>77456000202</Value>
                  </Attribute>
                  <Attribute>
                     <Name>zip</Name>
                     <Value>640014</Value>
                  </Attribute>
               </Attributes>
            </Component>
         </Components>
         <CommonData>
            <Attributes>
               <Attribute>
                  <Name>main_virtual_number</Name>
                  <Value>143522112322</Value>
               </Attribute>
            </Attributes>
         </CommonData>
      </types:SubmitOrderRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>